bases/WIM_FIn/projects/IMDEV-9458 Доработка обработки Формирование начислений НДФЛ/Расширения/IMDEV9458_EmptyTurnover/DataProcessors/ФормированиеНачисленийНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеНачисленийНДФЛ</Name>
		</Properties>
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантЗаполнения</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйПериод</Name>
					<Type><v8:Type>cfg:CatalogRef.Периоды</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыБезУдержаний</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыПоКлиентамБезЦБ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиПо</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиС</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Период</Name>
					<Type><v8:Type>v8:StandardPeriod</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоздаватьОплатуНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СхемаВыплаты</Name>
					<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>1</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетДляОплатыНалогов</Name>
					<Type><v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УправляющаяКомпания</Name>
					<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияПоЗакрытымПортфелям</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПоЗакрытымПортфелямСПоступлениемНКД</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьНДФЛПоКлиентамБезОборотов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаОборотовДляОтбораНДФЛ</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьНДФЛТолькоПоПулу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПулДляОтбораНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пул</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Дата</Name>
							<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УправляющаяКомпания</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Клиент</Name>
							<Type><v8:Type>cfg:CatalogRef.Контрагенты</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаРеинвестирования</Name>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>20</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-9458 Доработка обработки Формирование начислений НДФЛ/Расширения/IMDEV9458_EmptyTurnover/DataProcessors/ФормированиеНачисленийНДФЛ/Forms/Форма/Ext/Form/Module.bsl
#Область IMDEV9458

&НаСервере
&После("УправлениеФормой")
Процедура IMDEV9458_УправлениеФормой()

	// IMDEV-9458. Умолчание списка счетов и видимость поля при включённом флажке.
	Если Не ЗначениеЗаполнено(Объект.СчетаОборотовДляОтбораНДФЛ) Тогда
		Объект.СчетаОборотовДляОтбораНДФЛ = "90.01, 91.01, 91.03";
	КонецЕсли;

	Элементы.СчетаОборотовДляОтбораНДФЛ.Видимость = Объект.НеСоздаватьНДФЛПоКлиентамБезОборотов;

	Элементы.ПулДляОтбораНДФЛ.Видимость = Объект.СоздаватьНДФЛТолькоПоПулу;

КонецПроцедуры

&НаКлиенте
Процедура НеСоздаватьНДФЛПоКлиентамБезОборотовПриИзменении(Элемент)

	// IMDEV-9458
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура СоздаватьНДФЛТолькоПоПулуПриИзменении(Элемент)

	// IMDEV-9458
	УправлениеФормой();

КонецПроцедуры

#КонецОбласти
